tests/performance/tmp/run345/inference_taurus_local_monitoring_criteria/merged.yml
---
execution:
- concurrency: 1
  hold-for: 20s
  ramp-up: 5s
  scenario: Inference
modules:
  jmeter:
    properties:
      hostname: 127.0.0.1
      input_filepath: kitten.jpg
      management_port: 8081
      port: 8080
      protocol: http
  new_passfail:
    class: new_passfail.PassFailStatus
  server_local_monitoring:
    class: metrics_monitoring_taurus.Monitor
reporting:
- criteria:
  - fail of s2_fail >50%, stop as failed
  - p90 of s2_p90 >250ms  , stop as failed
  - avg-rt of s2_avg_rt >1s , stop as failed
  - class: bzt.modules.monitoring.MonitoringCriteria
    condition: '>'
    fail: true
    stop: true
    subject: ServerLocalClient/sum_workers_memory_rss
    threshold: 132000000
    timeframe: 1s
  module: passfail
- module: passfail
- data-source: pass-fail
  module: junit-xml
- data-source: sample-labels
  module: junit-xml
- dump-csv: ${BASEDIR}/final_stats.csv
  module: final-stats
scenarios:
  Inference:
    script: register_and_inference.jmx
services:
- ServerLocalClient:
  - interval: 1s
    metrics:
    - cpu
    - disk-space
    - mem
    - sum_workers_memory_rss
  module: server_local_monitoring
settings:
  env:
    BASEDIR: .